# Задача 7
# Есть словарь кодов товаров
# Рассчитать на какую сумму лежит каждого товара на складе.
#
# Вывести суммарную стоимость каждого товара на складе c помощью циклов
# Формат строки вывода: "<товар> - <кол-во> шт, стоимость <общая стоимость> руб"

titles = {
    'Кроссовки тип 3 - Adidas': '100000110',
    'Мячик тип 2     - Adidas': '100000146',
    'Кепка тип 1     - Adidas': '100000149',
    'Ремень тип 2    - Nike': '100000194',
    'Футболка тип 1  - Adidas': '100000224',
    'Шапка тип 5     - Puma': '100000280',
}

#  Есть словарь списков словарей количества товаров на складе.

sales = {
    '100000110': [{'quantity': 31, 'price': 1637}],
    '100000146': [ {'quantity': 4, 'price': 45}, {'quantity': 10, 'price': 48}],
    '100000149': [ {'quantity': 28, 'price': 279}, {'quantity': 32, 'price': 291}],
    '100000194': [{'quantity': 8, 'price': 220}, {'quantity': 1, 'price': 170}],
    '100000224': [{'quantity': 61, 'price': 438}, {'quantity': 23, 'price': 302},  {'quantity': 50, 'price': 412}],
    '100000280': [{'quantity': 26, 'price': 175}, ]
}

print('СЕЙЧАС НА СКЛАДЕ ОБНАРУЖЕН:')  
for key_t,val_t in titles.items():
  a = 0
  a_tot = 0
  b = 0
  c = 0.0
  for key_s,val_s in enumerate(sales[val_t]):
    a = val_s['quantity']
    a_tot += a
    b = val_s['price']
    c += round(a * b,2)
  print(f" Товар: {key_t} - в количестве {a_tot} на {c:.2f} руб.  ")
